00_journal/01_logs/journal_2_logs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Journal 2 Logs</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://hnvy.github.io/css/main.css" />
</head>
<body>
<div id="content" class="content">
<pre>
<code>> ./blog-1/00_journal/01_logs/journal_2_logs.html</code>
</pre>

<p>
<a href="https://hnvy.github.io/blog-1/">Home page</a> - <a href="https://github.com/hnvy/blog-1/edit/main/src/00_journal/01_logs/journal_2_logs.org">ESotP</a>
</p>

<p>
<a href="https://hnvy.github.io/blog-1/00_journal/01_logs/journal_1_logs.html">Previous part of log</a> - <a href="https://hnvy.github.io/blog-1/00_journal/01_logs/journal_3_logs.html">Next part of log</a>
</p>

<hr />

<div id="outline-container-intro" class="outline-2">
<h2 id="intro">Introduction</h2>
<div class="outline-text-2" id="text-intro">
<p>
See <a href="https://hnvy.github.io/about.html#journal">this</a>.
</p>
</div>
</div>

<div id="outline-container-org29jro21" class="outline-2">
<h2 id="org29jro21">E#016 (16/10/2022) - following a plan (T)</h2>
<div class="outline-text-2" id="text-org29jro21">
<p>
Recently, I have been slacking on my work. I open the computer, launch my usual work-related software, and then, once I think of something trivial such as "how to match the capturing group in the replace box using RegEx" go down a rabbit whole which takes 3-4 hours.
</p>

<p>
It is getting hideous, and frankly, I have had enough.
</p>

<p>
What follows is a public mini-reflection which utilises what I have spoken about <a href="https://hnvy.github.io/blog-1/00_journal/01_logs/journal_1_logs.html#org8d2b587">previously</a>:
</p>

<blockquote>
<p>
I need to complete this chapter. No, I want to complete this chapter. I have wasted too much time on trivial things that are not as useful as the chapter I am currently learning. Sure, learning how to match the capturing group in RegEx is cool, but is it useful <b>right now</b>? No.
</p>

<p>
The medical chapter I am referring to is fascinating. It is beautiful. Som much pathophysiology and so much content to learn about. So many new pieces of life-saving information that many before me have memorised and learned off by heart.
</p>

<p>
Memorisation is not the problem. I don't what is. My learn drive seems to, uselessly, want me to search up how to match the capturing group in RegEx rather than how to attempt to diagnose pneumonia using clinical judgement.
</p>

<p>
So, from now on, I will use <a href="https://github.com/hnvy/day-ploy">day-ploy</a> to fix this. I want to have a fixed routine where I don't waste time on things which do not benefit me right now.
</p>

<p>
Sure, this seems like a radical approach to some, but it isn't. I have stalled for too long. Although the chapter is quite lengthy, I shouldn't unjustifiably be afraid of it and put off acquiring what knowledge it can bestow upon me.
</p>
</blockquote>

<p>
Now that I got that off my chest, I should probably go back to work.
</p>

<p>
Side note: use <code>$0</code> or <code>${0}</code> to match the capturing group in the replace box in RegEx. See <a href="https://www.regular-expressions.info/replacebackref.html">this</a> for more detail.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
</div>
</body>
</html>
